app/controllers/admin_controller.rb

SELECT SUM(`accounts`.`balance`) AS sum_id FROM `accounts`
---
  def index
    @user_count = User.all.count
    @trans_count= Transaction.all.count
    @balance    = Account.sum(:balance)

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 6 LIMIT 1
SELECT `user_phones`.* FROM `user_phones` WHERE `user_phones`.`user_id` IN (900000001, 900000002, 900000003, 900000004, 900000005, 900000006, 980190962, 980190977, 980190979, 980190982, 980190983, 980190984, 980190985, 980190986, 980190987, 980190988, 980190989, 980190990, 980190991, 980190992, 980190993, 980190994, 980190995, 980190996, 980190997, 980190998, 980190999, 980191000, 980191001, 980191002, 980191003, 980191004, 980191005, 980191006, 980191007, 980191008, 980191009, 980191010, 980191011, 980191012, 980191013, 980191014, 980191015, 980191016, 980191017, 980191018, 980191019, 980191020, 980191021, 980191022, 980191023, 980191024, 980191025, 980191026, 980191027, 980191028, 980191029, 980191030, 980191031, 980191032, 980191033, 980191034, 980191035, 980191036, 980191037, 980191038, 980191039, 980191041, 980191043, 980191044, 980191045, 980191046, 980191047, 980191048, 980191051, 980191054, 980191055, 980191056, 980191057, 980191058, 980191059, 980191060, 980191061, 980191062, 980191063, 980191064, 980191065, 980191066, 980191067, 980191078)
---
  def users
    if @current_user.role.name == 'Company Admin'
      @users = User.find(:all, :conditions => ["(country_id = :c and role_id='5') or company_id = :cid", {:c => @current_user.country_id, :cid => @current_user.company_id}], :include => [:user_phones])

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 8000005 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 6 LIMIT 1
SELECT `transactions`.* FROM `transactions` WHERE ( (account_id=8000005 or 1<300)) ORDER BY created_at ASC
---
  def transactions
    @transactions = Transaction.find(:all, :conditions => [" (account_id=? or ?<300)", @current_user.account.id,  @current_user.role.code], :order => "created_at ASC")